# IsPlenum Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadSpaceType..::..IsPlenum Property
HVACLoadSpaceType Class See Also
---
True if the space type is plenum.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsPlenum { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPlenum As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPlenum {
	bool get ();
}
```

# See Also
HVACLoadSpaceType Class
Autodesk.Revit.DB.Analysis Namespace